; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-91)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b22)
    (on b22 b8)
    (on-table b8)
    (clear b13)
    (on b13 b27)
    (on b27 b7)
    (on b7 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b18)
    (on b18 b3)
    (on b3 b15)
    (on b15 b14)
    (on b14 b25)
    (on-table b25)
    (clear b19)
    (on b19 b9)
    (on b9 b16)
    (on b16 b20)
    (on-table b20)
    (clear b11)
    (on b11 b26)
    (on b26 b1)
    (on b1 b24)
    (on b24 b12)
    (on b12 b4)
    (on b4 b10)
    (on b10 b6)
    (on b6 b21)
    (on b21 b23)
    (on-table b23))
 (:goal (and 
(on-table b20)
(clear b23) (on b23 b22)
))
)

; plan
1. (unstack b11 b26)
   deleted: (on b11 b26) (clear b11) (arm-empty)
   added: (holding b11) (clear b26)
   goals met: 1 of 3
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 3
3. (unstack b26 b1)
   deleted: (on b26 b1) (clear b26) (arm-empty)
   added: (holding b26) (clear b1)
   goals met: 1 of 3
4. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 3
5. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 1 of 3
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 3
7. (unstack b24 b12)
   deleted: (on b24 b12) (clear b24) (arm-empty)
   added: (holding b24) (clear b12)
   goals met: 1 of 3
8. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 3
9. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 1 of 3
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 3
11. (unstack b4 b10)
   deleted: (on b4 b10) (clear b4) (arm-empty)
   added: (holding b4) (clear b10)
   goals met: 1 of 3
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 3
13. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 1 of 3
14. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 3
15. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 1 of 3
16. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 3
17. (unstack b21 b23)
   deleted: (on b21 b23) (clear b21) (arm-empty)
   added: (holding b21) (clear b23)
   goals met: 2 of 3
18. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 3
19. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 1 of 3
20. (stack b23 b22)
   deleted: (clear b22) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b22)
   goals met: 3 of 3
